{
  "posts": [
    {
      "id": 16,
      "title": "Tai nghe nhét tai Devia Cổng Lightning",
      "desc": "Tai nghe Devia Smart Series Stereo Wired (Lightning) thiết kế nhỏ gọn bền bỉ Chiếc tai nghe có dây của bạn đang dùng đã quá cũ và trải nghiệm âm không còn tốt? Hãy thay thế ngay tai nghe Devia Smart Series Stereo Wired (Lightning) công nghệ mới. Đó là điều cần thiết để bạn thưởng thức âm nhạc đồng thời bảo vệ đôi tai của mình.  Thiết kế công thái học vừa vặn, dây dài 1.2m Tai nghe Devia Smart Series Stereo Wired sở hữu thiết kế công thái học với ốc tai kích thước vừa phải, bọc lớp cao su tránh đau tai. Kích thước nhỏ gọn và cân nặng cực nhỏ không gây nặng nề cả khi bạn đeo tai nghe hàng giờ.  Sợi dây tai nghe 1.2m được bao bọc bởi lớp vỏ bền bỉ bảo vệ lõi bên trong hỗ trợ âm thanh được truyền tải ổn định. Nút bấm vật lý tăng giảm volume tích hợp trên dây, tiện lợi thay đổi độ lớn âm thanh khi cần thiết.",
      "images1": "http://res.cloudinary.com/dcjtdlsw7/image/upload/v1645019628/r58rvd9wpqdqxb4pf16f.png",
      "images2": "http://res.cloudinary.com/dcjtdlsw7/image/upload/v1645019628/jhijzev7zngo6pagaghx.png",
      "price": "250",
      "categoryId": 2
    },
    {
      "id": 17,
      "title": "Tai nghe JBL C150SI",
      "desc": "JBL C150SI – Tai nghe giá rẻ cho người dùng phổ thông Bên cạnh việc làm ra những tai nghe tầm cao cấp thì những chiếc tai nghe giá rẻ đến từ nhà JBL như chiếc tai nghe JBL C150SI cũng được hãng cực kì chăm chút về mặt thiết kế cũng như chất âm bên trong của nó.  JBL thuộc hãng loa top đầu thế giới với chất âm trầm đặc trưng JBL là một công ty được thành lập tại Mỹ vào năm 1946 bởi người kỹ sư âm thanh tài ba James Bullough Lansing. Vào những ngày đầu công ty đã gặp khó khăn nhưng sau khi trở về với công ty Harman Kardon cùng với sự cố gắng cải thiện mình trong từng sản phẩm, JBL đã dần chiếm được lòng tin của người tiêu dùng và vươn lên top đầu những hãng sản xuất âm thanh.",
      "images1": "http://res.cloudinary.com/dcjtdlsw7/image/upload/v1645104365/qpkhzfoteuh1liyph9yv.png",
      "images2": "http://res.cloudinary.com/dcjtdlsw7/image/upload/v1645104366/ccyr4n4tisswtk0zoftj.png",
      "price": "250",
      "categoryId": 2
    },
    {
      "id": 18,
      "title": "Tai nghe KZ EDX Pro",
      "desc": "Tai nghe KZ EDX Pro - Âm thanh khác biệt Thật khó tìm trên thị trường có những chiếc tai nghe có dây hỗ trợ cho trải nghiệm âm thanh chuẩn xác. Nhưng đâu đó, chúng ta vẫn tìm ra được một sản phẩm, mang tên tai nghe KZ EDX Pro, tích hợp những công nghệ bậc nhất trên thị trường.  Thiết kế housing trong suốt, trọng lượng nhẹ dễ đeo Về tổng quan, tai nghe KZ EDX Pro sở hữu vẻ ngoài mang tính thẩm mỹ cao. Bởi phủ một lớp nhựa trong suốt, cho phép thể hiện rõ những cấu tạo ở bên trong tai nghe. ",
      "images1": "http://res.cloudinary.com/dcjtdlsw7/image/upload/v1645104330/ippg2ezh1ahont51ittz.png",
      "images2": "http://res.cloudinary.com/dcjtdlsw7/image/upload/v1645104330/gybd10yfvc6xfkpo3oai.png",
      "price": "300",
      "categoryId": 2
    },
    {
      "title": "Tai nghe Bluetooth Xiaomi Earbud Basic S",
      "images1": "http://res.cloudinary.com/dcjtdlsw7/image/upload/v1644933457/xllsnj9qwfcsyrs2y7uh.png",
      "images2": "http://res.cloudinary.com/dcjtdlsw7/image/upload/v1644933458/g1jqqsegeiqnqcdbm3ze.png",
      "desc": "Tai nghe không dây Xiaomi Mi True Wireless Earbuds Basic S - Âm thanh sống động, kết nối vững chắc Sự thành công của các mẫu tai nghe bluetooth trước đó đã làm cho hãng Xiaomi tiếp tục ra mắt sản phẩm mới mang tên tai nghe Xiaomi Earbuds Basic S. Mang hình dáng công thái học gọn nhẹ, sử dụng driver 7.2mm cho chất âm tuyệt hảo cùng công nghệ Bluetooth 5.0, cặp tai nghe Mi True Wireless Basic S sẽ là món phụ kiện đáng sở hữu trong tầm giá.  Thiết kế công thái học với kích cỡ gọn nhẹ, thoải mái đeo ngày dài Tai nghe không dây Xiaomi Earbuds Basic S có thiết kế công thái học với màu đen cuốn hút, tạo nên nét tinh tế trên tai bạn. Kích cỡ nhỏ nhắn với trọng lượng siêu nhẹ chỉ 4.1g mỗi bên củ tai sẽ đảm bảo bạn tận hưởng được âm nhạc một cách thoải mái trong mọi hoạt động ngoài trời.",
      "price": "500",
      "categoryId": 1,
      "id": 19
    },
    {
      "id": 20,
      "title": "Tai nghe không dây Soundprats Gamer no 1",
      "desc": "",
      "images1": "http://res.cloudinary.com/dcjtdlsw7/image/upload/v1645104279/eyhdejxnphvyyhc19rzg.png",
      "images2": "http://res.cloudinary.com/dcjtdlsw7/image/upload/v1645104279/loantyzvf0bqmesdv6si.png",
      "price": "750",
      "categoryId": 1
    },
    {
      "title": "Tai nghe không dât Defunv True Basic",
      "images1": "http://res.cloudinary.com/dcjtdlsw7/image/upload/v1645104241/uwkoejllgyps7xoxtwis.png",
      "images2": "http://res.cloudinary.com/dcjtdlsw7/image/upload/v1645104242/n0uwxiiior4t7cv5wfuf.png",
      "desc": "Tai nghe không dây Defunc True Basic – Tai nghe sang trọng, hiện đại Nhà thiết kế Thụy Điển lại tiếp tục cho ra một sản phẩm tai nghe không dây có thiết kế gọn gàng, màu sắc tinh tế trang nhã hiện đại. Tính năng hiện đại tích hợp trong tai nghe không dây Defunc True Basic, thu hút sự quan tâm của đông đảo người tiêu dùng.  Thiết kế hiện đại không dây, 6 phiên bản màu sắc Defunc True Basic có thiết kế nhỏ gọn, trọng lượng nhẹ cho người dùng cảm giác thoải mái khi sử dụng. Nút tai có thiết kế kiểu in-ear với kích thước chuẩn ôm khít lấy tai nghe. Có nút bấm để chuyển chế độ trên tai nghe.",
      "price": "550",
      "categoryId": 1,
      "id": 21
    }
  ],
  "users": [
    {
      "email": "cuongndph18057@fpt.edu.vn",
      "password": "$2a$10$81/2hj3.FZ20BW7iuzvKvuUeHtwDKZ.wOdw9qqMrjY4S3J79x.IbS",
      "username": "nguoidung",
      "id": 1
    },
    {
      "email": "cuongndph18057@fpt.edu.vbn",
      "password": "$2a$10$7QvZdiYyQ7E9VgRLwmcup.QFrBKiWWwWknZPGOYdm2rm8ZfMU91c.",
      "username": "nguyễn đức cường",
      "id": 2
    },
    {
      "email": "cuongndph18057@fpt.edu.vbnq",
      "password": "$2a$10$.kZT19P/DVXM2GXScRMZ5OUz0JhVWNZq0IU09HjzUivvLoHyP6t4m",
      "username": "nguyễn đức cường",
      "id": 3
    }
  ],
  "categorys": [
    {
      "id": 1,
      "name": "Không Dây"
    },
    {
      "id": 2,
      "name": "Có Dây"
    }
  ]
}